OpenFOAM_Artery_Lab_ADT/openfoam9/tutorials/combustion/coldEngineFoam/freePiston/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0          0           0)
    (0.05      -0.000872753 0)
    (0.05       0.000872753 0)
    (0          0           0.13)
    (0.05      -0.000872753 0.13)
    (0.05       0.000872753 0.13)
);

blocks
(
    hex (0 1 2 0 3 4 5 3) (50 1 130) simpleGrading (1 1 1)
);

boundary
(
    front
    {
        type wedge;
        faces
        (
            (0 1 4 3)
        );
    }
    back
    {
        type wedge;
        faces
        (
            (0 3 5 2)
        );
    }
    piston
    {
        type wall;
        faces
        (
            (0 2 1 0)
        );
    }
    cylinderHead
    {
        type wall;
        faces
        (
            (3 4 5 3)
        );
    }
    axis
    {
        type empty;
        faces
        (
            (0 3 3 0)
        );
    }
    liner
    {
        type wall;
        faces
        (
            (1 2 5 4)
        );
    }
);


// ************************************************************************* //
